<?php

namespace Simflex\Core\System\Events;

enum Events
{
    /**
     * Вызывается перед инициализацией ядра и страницы
     */
    case PreInit;

    /**
     * Вызывается после инициализации ядра и страницы
     */
    case PostInit;

    /**
     * Вызывается перед выполнением ядра
     */
    case PreExecute;

    /**
     * Вызывается после выполнения ядра
     */
    case PostExecute;

    /**
     * Вызывается перед изменением вывода страницы
     *
     * Аргументы:
     *  - string $data - исходный контент страницы
     */
    case PrePrepareOutput;

    /**
     * Вызывается после изменения вывода страницы
     *
     * Аргументы:
     *  - string $data - возможно измененный контент страницы
     */
    case PostPrepareOutput;

    /**
     * Вызывается перед инициализацией авторизации
     */
    case PreAuthInit;

    /**
     * Вызывается после инициализации авторизации
     */
    case PostAuthInit;

    /**
     * Вызывается перед добавлением страницы (сайта или админки) в Container
     */
    case PrePageInit;

    /**
     * Вызывается после добавления страницы (сайта или админки) в Container
     */
    case PostPageInit;

    /**
     * Вызывается перед инициализацией логгера
     */
    case PreLoggerInit;

    /**
     * Вызывается после инициализации логгера
     */
    case PostLoggerInit;

    /**
     * Вызывается перед заполнением данных модели
     *
     * Аргументы:
     *  - mixed $model - экземпляр модели
     */
    case PreModelFill;

    /**
     * Вызывается после заполнения данных модели
     *
     * Аргументы:
     *  - mixed $model - экземпляр модели
     */
    case PostModelFill;

    /**
     * Вызывается перед сохранением модели
     *
     * Аргументы:
     * - mixed $model - экземпляр модели
     */
    case PreModelSave;

    /**
     * Вызывается после сохранения модели
     *
     * Аргументы:
     * - mixed $model - экземпляр модели
     * - bool $result - результат сохранения
     */
    case PostModelSave;

    /**
     * Вызывается перед вставкой модели
     *
     * Аргументы:
     * - mixed $model - экземпляр модели
     */
    case PreModelInsert;

    /**
     * Вызывается после вставки модели
     *
     * Аргументы:
     * - mixed $model - экземпляр модели
     * - bool $result - результат вставки
     */
    case PostModelInsert;

    /**
     * Вызывается перед обновлением модели
     *
     * Аргументы:
     * - mixed $model - экземпляр модели
     */
    case PreModelUpdate;

    /**
     * Вызывается после обновления модели
     *
     * Аргументы:
     * - mixed $model - экземпляр модели
     * - bool $result - результат обновления
     */
    case PostModelUpdate;

    /**
     * Вызывается перед удалением модели
     *
     * Аргументы:
     * - mixed $model - экземпляр модели
     */
    case PreModelDelete;

    /**
     * Вызывается после удаления модели
     *
     * Аргументы:
     * - array $oldData - прежние данные модели
     * - bool $result - результат удаления
     */
    case PostModelDelete;

    case Custom;
}
